# Financial App

In [1]:
import os
import pandas as pd

# Get the current working directory
os.chdir("c:/Users/juanm_8qa8lav/Documents/Proyectos_Personales/FinancialApp")
# Verify the current working directory
print(f"Now in directory: {os.getcwd()}")

# Import your module
from app.modules.database.connection import engine
import app.modules.database.credit_manager as credit_manager
import app.modules.database.portfolio_manager as portfolio_manager
import app.modules.database.customers as customers

from importlib import reload

%run logs/run_log.py

Now in directory: c:\Users\juanm_8qa8lav\Documents\Proyectos_Personales\FinancialApp
Nuevo plan de negocio creado, su id es 1 y fue asociado a la empresa NeoCrediT S.A.
Nuevo plan de negocio creado, su id es 2 y fue asociado a la empresa Onoyen S.R.L.
Nuevo plan de negocio creado, su id es 3 y fue asociado a la empresa Asociación Mutual Union Federal
Nuevo plan de negocio creado, su id es 4 y fue asociado a la empresa Asociación Mutual Union Federal

In [2]:
from app.modules.database.credit_manager import credits_balance
balance = credits_balance()
print(f'Deuda Total: $ {balance['Total'].sum():,.2f}')

# balance[['Capital', 'Interest', 'IVA', 'Total']] = balance[['Capital', 'Interest', 'IVA', 'Total']].map('${:,.2f}'.format)
balance

Deuda Total: $ 38,986.34

      ID_Op  Nro_Inst      D_Due   Capital  Interest  IVA     Total  ID_Owner
ID
1         1         1 2022-10-20      0.00      0.00  0.0      0.00         1
2         1         2 2022-11-20      0.00      0.00  0.0      0.00         1
3         1         3 2022-12-20      0.00      0.00  0.0      0.00         1
4         1         4 2023-01-20      0.00      0.00  0.0      0.00         1
5         1         5 2023-02-20      0.00      0.00  0.0      0.00         1
...     ...       ...        ...       ...       ...  ...       ...       ...
2726    152        14 2024-08-20      0.00      0.00  0.0      0.00         1
2727    152        15 2024-09-20      0.00      0.00  0.0      0.00         1
2728    152        16 2024-10-20      0.00      0.00  0.0      0.00         1
2729    152        17 2024-11-20      0.00      0.00  0.0      0.00         1
2730    152        18 2024-12-20  17765.61   1679.22  0.0  19444.82         1

[2730 rows x 8 columns]

In [3]:
pd.read_sql('companies', engine, index_col='ID')

                      Social_Reason         CUIT  Advance
ID
1                    NeoCrediT S.A.  30717558142      0.0
2                     Onoyen S.R.L.  30711188069      0.0
3   Asociación Mutual Union Federal  30708721561      0.0

In [4]:
pd.read_sql('portfolio_purchases', engine, index_col='ID')

         Date  ID_Company    TNA  Buyback  Resource  IVA
ID
1  2022-12-21           2  0.885        0         1    0
2  2023-02-22           2  0.870        0         1    0
3  2023-03-21           2  0.670        0         1    0
4  2023-04-18           2  0.620        0         1    0
5  2023-05-18           2  0.590        0         1    0
6  2023-06-15           2  0.480        0         1    0

In [12]:
from app.modules.database.credit_manager import credits_balance
balance = credits_balance()
print(f'Deuda Total: $ {balance['Total'].sum():,.2f}')

# balance[['Capital', 'Interest', 'IVA', 'Total']] = balance[['Capital', 'Interest', 'IVA', 'Total']].map('${:,.2f}'.format)
balance.loc[balance['Total'] > 0]

Deuda Total: $ 38,986.34

      ID_Op  Nro_Inst      D_Due   Capital  Interest  IVA     Total  ID_Owner
ID
2658    148        18 2024-12-20   7121.16    585.29  0.0   7706.45         1
2712    151        18 2024-12-20  10813.02   1022.05  0.0  11835.07         1
2730    152        18 2024-12-20  17765.61   1679.22  0.0  19444.82         1

In [6]:
credits = pd.read_sql('credits', engine, index_col='ID')
collections = pd.read_sql('collection', engine, index_col='ID')
installments = pd.read_sql('installments', engine, index_col='ID')
companies = pd.read_sql('companies', engine, index_col='ID')

installments['IVA'] = installments['Interest'] * 0.21
installments['Total'] += installments['IVA']
installments['Total'] = installments['Total'].round(2)

In [7]:
print(f'${installments.loc[installments['ID_Op'] == 148, 'Capital'].sum() - credits.loc[148, 'Cap_Grant']:,.2f}')
print(f'${installments.loc[installments['ID_Op'] == 148, 'Total'].sum() - (credits.loc[148, 'V_Inst'] * credits.loc[148, 'N_Inst']):,.2f}')

installments.loc[installments['ID_Op'] == 148]

$0.01
$-0.01

,ID_Op,Nro_Inst,D_Due,Capital,Interest,IVA,Total,ID_Owner
ID,,,,,,,,
2641,148,1,2023-07-20,1420.91,5296.24,1112.2104,7829.36,1
2642,148,2,2023-08-20,1562.22,5179.45,1087.6845,7829.35,1
2643,148,3,2023-09-20,1717.58,5051.05,1060.7205,7829.36,1
2644,148,4,2023-10-20,1888.40,4909.89,1031.0769,7829.36,1
2645,148,5,2023-11-20,2076.20,4754.68,998.4828,7829.36,1
2646,148,6,2023-12-20,2282.68,4584.03,962.6463,7829.36,1
2647,148,7,2024-01-20,2509.69,4396.42,923.2482,7829.36,1
2648,148,8,2024-02-20,2759.28,4190.15,879.9315,7829.36,1
2649,148,9,2024-03-20,3033.69,3963.36,832.3056,7829.36,1
2650,148,10,2024-04-20,3335.39,3714.02,779.9442,7829.35,1
2651,148,11,2024-05-20,3667.10,3439.89,722.3769,7829.36,1
2652,148,12,2024-06-20,4031.79,3138.49,659.0829,7829.36,1
2653,148,13,2024-07-20,4432.75,2807.12,589.4952,7829.37,1
2654,148,14,2024-08-20,4873.59,2442.79,512.9859,7829.36,1
2655,148,15,2024-09-20,5358.27,2042.23,428.8683,7829.36,1
2656,148,16,2024-10-20,5891.15,1601.83,336.3843,7829.36,1
2657,148,17,2024-11-20,6477.02,1117.64,234.7044,7829.36,1
2658,148,18,2024-12-20,7121.16,585.29,122.9109,7829.36,1

In [8]:
credits.loc[148]

ID_External                       18596
ID_Client                           123
Date_Settlement     2023-04-25 00:00:00
ID_BP                                 2
Cap_Requested                  64438.86
Cap_Grant                      64438.86
N_Inst                               18
First_Inst_Purch                      1
TEM_W_IVA                       0.09945
V_Inst                          7829.36
First_Inst_Sold                       0
D_F_Due             2023-07-20 00:00:00
ID_Purch                              6
ID_Sale                            None
Name: 148, dtype: object

In [9]:
installments.loc[balance.loc[balance['Total'] > 0].index]

,ID_Op,Nro_Inst,D_Due,Capital,Interest,IVA,Total,ID_Owner
ID,,,,,,,,
2658,148,18,2024-12-20,7121.16,585.29,122.9109,7829.36,1
2712,151,18,2024-12-20,10813.02,1022.05,214.6305,12049.70,1
2730,152,18,2024-12-20,17765.61,1679.22,352.6362,19797.46,1